@extends('layouts.app')

@section('content')
<div class="bg-yellow-200 flex min-h-screen items-center justify-center flex-wrap">
    <div class="w-10/12 lg:w-8/12">
        <h1 class="text-gray-800 font-bold text-2xl mb-4">¿Que estás buscando?</h1>
        <div class="relative">
            <form action="{{ route('create_search') }}" method="post">
                @csrf
                <input class="shadow w-full h-9 p-4 outline-none" placeholder="Mesita ratonera" name="search" />
                @error('search')
                <div class="text-red-600 p-4 text-xs">{{ $message }}</div>
                @enderror
                <button type="submit">
                    <svg class="absolute top-0 right-0 cursor-pointer" height='60px' width='60px' fill="#3e3e3e" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 100 100" version="1.1" x="0px" y="0px">
                        <g fill-rule="nonzero">
                            <path d="M30.3872517,47.979531 C30.4160843,48.257789 30.6600715,48.5069527 30.934203,48.5362667 L46.4417125,50.1945468 C47.8194217,50.3418707 47.8208717,50.580575 46.4417125,50.728054 L30.934203,52.3863341 C30.6609628,52.4155527 30.4155997,52.6694894 30.3872517,52.9430698 L29.1170978,65.2010631 C29.0882651,65.4793211 29.2801802,65.622879 29.5281104,65.5284294 L68.6161053,50.6377647 C68.871934,50.5403061 68.8640356,50.3792857 68.6161053,50.2848361 L29.5281104,35.3941714 C29.2722818,35.2967128 29.0887498,35.4479573 29.1170978,35.7215377 L30.3872517,47.979531 Z M30.5239304,49.4980958 C29.9740126,49.4392909 29.481323,48.9390643 29.4253048,48.3984445 L28.0056935,34.6980693 C27.9488572,34.1495536 28.3240176,33.8653643 28.8418326,34.0626272 L70.9492994,50.1035669 C71.4679226,50.3011377 71.4671144,50.621771 70.9492994,50.8190338 L28.8418326,66.8599736 C28.3232094,67.0575443 27.9496754,66.7651512 28.0056935,66.2245315 L29.4253048,52.5241562 C29.4821411,51.9756405 29.9709475,51.4836376 30.5239304,51.424505 L39.0353388,50.514346 C39.3093048,50.4850497 39.303673,50.4369488 39.0353388,50.4082548 L30.5239304,49.4980958 Z"></path>
                        </g>
                    </svg>
                </button>
            </form>
        </div>
    </div>
</div>
@endsection